app/controllers/microposts_controller.rb

  def like
    @micropost_t = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 2532], ["LIMIT", 1]]

  def unlike
    @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 2532], ["LIMIT", 1]]